# Pandas Data Handling and Computation
#### Series

In [29]:
import pandas as pd
import numpy as np
import time

In [30]:
# make tuple
lnb_tupl1 = (1,2,3,4,"five","six",'seven','eight')

# creating/converting into pd Series
lnb_series1 = pd.Series(lnb_tupl1)
lnb_series11 = pd.Series(lnb_tupl1,name='LnB_series',index=range(2,10))
print(type(lnb_series1))
print(lnb_series1)
print("\nlnb_series11:")
print(lnb_series11)

<class 'pandas.core.series.Series'>
0        1
1        2
2        3
3        4
4     five
5      six
6    seven
7    eight
dtype: object

lnb_series11:
2        1
3        2
4        3
5        4
6     five
7      six
8    seven
9    eight
Name: LnB_series, dtype: object

In [31]:
# print head of series
print(lnb_series1.head())
# print tail of lnb_series1
print(lnb_series1.tail())
# print random sample elements
print(lnb_series1.sample(2))

0       1
1       2
2       3
3       4
4    five
dtype: object
3        4
4     five
5      six
6    seven
7    eight
dtype: object
4    five
1       2
dtype: object

In [32]:
# Creating Series from Dictionary
lnb_dict1 = {'lnb1':'IoT','lnb2':'AI','lnb3':'DevOps'}
lnb_series2 = pd.Series(lnb_dict1)
print("Printing dictionary as series...")
print(lnb_series2)

# Creating from another Series
lnb_series3 = pd.Series(lnb_series1,copy=True)

# updating series
lnb_series3[0] = "Hello World"
print(lnb_series3)
print(lnb_series1)

Printing dictionary as series...
lnb1       IoT
lnb2        AI
lnb3    DevOps
dtype: object
0    Hello World
1              2
2              3
3              4
4           five
5            six
6          seven
7          eight
dtype: object
0        1
1        2
2        3
3        4
4     five
5      six
6    seven
7    eight
dtype: object

In [33]:
# another dictionary
lnb_dict2 = {'Name': ['Xavier','Scott','Logan'], 'Alias':['Professor X','Cyclops','Wolverine']}
print(lnb_dict2)
lnb_series4 = pd.Series(lnb_dict2) 
print(lnb_series4)

# changing
print("\nchanging...")
lnb_series4.iloc[0] = ['Ed','Edd','Eddy']
print(lnb_series4)
print(lnb_dict2)

{'Name': ['Xavier', 'Scott', 'Logan'], 'Alias': ['Professor X', 'Cyclops', 'Wolverine']}
Name                [Xavier, Scott, Logan]
Alias    [Professor X, Cyclops, Wolverine]
dtype: object

changing...
Name                       [Ed, Edd, Eddy]
Alias    [Professor X, Cyclops, Wolverine]
dtype: object
{'Name': ['Xavier', 'Scott', 'Logan'], 'Alias': ['Professor X', 'Cyclops', 'Wolverine']}

#### Attrributes of Pandas Series

In [34]:
# Transpose
print(lnb_series1)
print("\ntransposing...")
print(lnb_series1.T)

0        1
1        2
2        3
3        4
4     five
5      six
6    seven
7    eight
dtype: object

transposing...
0        1
1        2
2        3
3        4
4     five
5      six
6    seven
7    eight
dtype: object

In [35]:
print(lnb_series1[[0,4,5]])
print(lnb_series1[0:5])

0       1
4    five
5     six
dtype: object
0       1
1       2
2       3
3       4
4    five
dtype: object

In [36]:
print(lnb_series2)
print()
print(".get('lnb1'): ",lnb_series2.get('lnb1'))
print(".at['lnb2']: ",lnb_series2.at['lnb2'])

# accessing using index
print(".iloc[0]: ",lnb_series2.iloc[0])
print(".iat[1]: ",lnb_series2.iat[1])

lnb1       IoT
lnb2        AI
lnb3    DevOps
dtype: object

.get('lnb1'):  IoT
.at['lnb2']:  AI
.iloc[0]:  IoT
.iat[1]:  AI

In [37]:
# accessing the index
print(lnb_series1.axes)
print(lnb_series2.axes)

[RangeIndex(start=0, stop=8, step=1)]
[Index(['lnb1', 'lnb2', 'lnb3'], dtype='object')]

In [38]:
# creating a new directory
hetero_list = [1,4,2,'lnb',None,True]
lnb_series4= pd.Series(hetero_list)
print(type(lnb_series2))

# checking is NaN values are in the list
print(lnb_series4.hasnans)

# checking values in series
print(lnb_series4.values)

<class 'pandas.core.series.Series'>
True
[1 4 2 'lnb' None True]

In [39]:
# creating list and also handling NaN name error
from numpy.core.numeric import NaN
incomplete_list = [NaN, 0, 2, 5, NaN, 7, True, NaN]
print(incomplete_list)

# convert into series
s1 = pd.Series(incomplete_list)
print(s1)

# for loop
lnb_series1.index = range(2,10) 
for i in lnb_series1.items():
    print(i)
    time.sleep(1)

[nan, 0, 2, 5, nan, 7, True, nan]
0     NaN
1       0
2       2
3       5
4     NaN
5       7
6    True
7     NaN
dtype: object
(2, 1)
(3, 2)
(4, 3)
(5, 4)
(6, 'five')
(7, 'six')
(8, 'seven')
(9, 'eight')

In [40]:
# arithmethic operations
s2 = pd.Series([1,2,3,4], index=['a','b','c','d'])
s3 = pd.Series([3,15,-6,7.3], index=['b','c','d','a'])
s4 = s2.add(s3) # add
print("Addition:")
print(s4)
print("\nSubtraction:")
print(s2.sub(s3))
print("\nMultiplication:")
print(s2.multiply(s3))
print("\nDivision:")
print(s2.div(s3))

Addition:
a     8.3
b     5.0
c    18.0
d    -2.0
dtype: float64

Subtraction:
a    -6.3
b    -1.0
c   -12.0
d    10.0
dtype: float64

Multiplication:
a     7.3
b     6.0
c    45.0
d   -24.0
dtype: float64

Division:
a    0.136986
b    0.666667
c    0.200000
d   -0.666667
dtype: float64

#### DataFrame

In [41]:
# creating a dictionary
data = {"name":['Emma Frost','Tony Stark','Nick Fury'], "weight":[23,32,46], "team":['X-men','Avengers','S.H.I.E.L.D.']}

# Method 1
# creating data frame
df = pd.DataFrame(data)
print(df)

# transposing dataframe
print("\ntransposing...")
print(df.T)

         name  weight          team
0  Emma Frost      23         X-men
1  Tony Stark      32      Avengers
2   Nick Fury      46  S.H.I.E.L.D.

transposing...
                 0           1             2
name    Emma Frost  Tony Stark     Nick Fury
weight          23          32            46
team         X-men    Avengers  S.H.I.E.L.D.

In [42]:
# Method 2 - dict / dict 
d1 = {1: {'name':'Alex', 'age':23, 'place':'Philippines', 'food':'chapati'},
2: {'name':'Frenza', 'age':21, 'place':'Venezuala', 'food':'burgers'},
3: {'name':'Esosa', 'age':23, 'place':'Nigeria', 'food':'Jollof rice'},
4: {'name':'Bruce', 'age':35, 'place':'Gotham', 'food':'Vengeance!'}}

# creating dataframe
df1 = pd.DataFrame(d1)
print(df1)
print()
print(df1.T)

                 1          2            3           4
name          Alex     Frenza        Esosa       Bruce
age             23         21           23          35
place  Philippines  Venezuala      Nigeria      Gotham
food       chapati    burgers  Jollof rice  Vengeance!

     name age        place         food
1    Alex  23  Philippines      chapati
2  Frenza  21    Venezuala      burgers
3   Esosa  23      Nigeria  Jollof rice
4   Bruce  35       Gotham   Vengeance!

In [57]:
# Method 3 - list / list
d2 = [[1,2,3,4], [5,6,7,8], [9,10,11,12], [13,14,15,16]]
df2 = pd.DataFrame(d2, index=['a','b','c','d'],columns=['A','B','C','D'])
print(df2)

# Method Extra ;]
df3 = pd.DataFrame(np.arange(16).reshape(4,4))
print()
print(df3)

    A   B   C   D
a   1   2   3   4
b   5   6   7   8
c   9  10  11  12
d  13  14  15  16

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [58]:
# from numpy to dict
newdf = pd.DataFrame(np.random.rand(25,4), index=np.arange(25), columns=['W','X','Y','Z'])
print(newdf)

           W         X         Y         Z
0   0.729399  0.819464  0.763112  0.639822
1   0.837596  0.979585  0.658620  0.642746
2   0.517834  0.153001  0.298523  0.008185
3   0.233905  0.231963  0.940261  0.109975
4   0.952357  0.297629  0.305200  0.785417
5   0.032351  0.941969  0.177668  0.913786
6   0.197170  0.785136  0.540764  0.259099
7   0.692427  0.314305  0.310682  0.727924
8   0.503748  0.589238  0.674512  0.170139
9   0.662340  0.598846  0.372235  0.491157
10  0.892904  0.963011  0.102655  0.823819
11  0.592734  0.615963  0.213199  0.666125
12  0.390168  0.032675  0.631657  0.029880
13  0.292861  0.991673  0.083141  0.160287
14  0.753096  0.908201  0.355214  0.105509
15  0.383179  0.864812  0.483351  0.522719
16  0.932710  0.027006  0.142203  0.086504
17  0.186808  0.461585  0.633189  0.690254
18  0.652366  0.751549  0.186722  0.540154
19  0.074648  0.900529  0.425808  0.763363
20  0.812342  0.501961  0.970318  0.638544
21  0.039985  0.428559  0.262283  0.815041
22  0.033122  0.718596  0.755160  0.405604
23  0.613174  0.363387  0.049469  0.426620
24  0.880040  0.589181  0.081513  0.262620

In [59]:
# operations
# printing first row
print(newdf.iloc[0])
# row range
print(newdf.iloc[0:3])

# top 5 and bottom 5rows
print("\nHead:")
print(newdf.head())
print("\nTail:")
print(newdf.tail())

W    0.729399
X    0.819464
Y    0.763112
Z    0.639822
Name: 0, dtype: float64
          W         X         Y         Z
0  0.729399  0.819464  0.763112  0.639822
1  0.837596  0.979585  0.658620  0.642746
2  0.517834  0.153001  0.298523  0.008185

Head:
          W         X         Y         Z
0  0.729399  0.819464  0.763112  0.639822
1  0.837596  0.979585  0.658620  0.642746
2  0.517834  0.153001  0.298523  0.008185
3  0.233905  0.231963  0.940261  0.109975
4  0.952357  0.297629  0.305200  0.785417

Tail:
           W         X         Y         Z
20  0.812342  0.501961  0.970318  0.638544
21  0.039985  0.428559  0.262283  0.815041
22  0.033122  0.718596  0.755160  0.405604
23  0.613174  0.363387  0.049469  0.426620
24  0.880040  0.589181  0.081513  0.262620

In [60]:
# describe df
print("\nDescribe Data:")
print(newdf.describe())

# index and columns
print(f'\nIndex: {newdf.index}', 
      f'\nColumns: {newdf.columns}')

Describe Data:
               W          X          Y          Z
count  25.000000  25.000000  25.000000  25.000000
mean    0.515571   0.593193   0.416698   0.467412
std     0.308193   0.302289   0.274186   0.286588
min     0.032351   0.027006   0.049469   0.008185
25%     0.233905   0.363387   0.186722   0.170139
50%     0.592734   0.598846   0.355214   0.522719
75%     0.753096   0.864812   0.633189   0.690254
max     0.952357   0.991673   0.970318   0.913786

Index: Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
            17, 18, 19, 20, 21, 22, 23, 24],
           dtype='int64')
Columns: Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [61]:
# accessing dataframe
print(newdf['W'][0:13]) # df['ColumnId']['Row Id]
print(f'\n{newdf["W"][0]}')

# random rows
print(newdf.iloc[0:3,0:2]) # df.iloc[Row,Column]

0     0.729399
1     0.837596
2     0.517834
3     0.233905
4     0.952357
5     0.032351
6     0.197170
7     0.692427
8     0.503748
9     0.662340
10    0.892904
11    0.592734
12    0.390168
Name: W, dtype: float64

0.7293985863827624
          W         X
0  0.729399  0.819464
1  0.837596  0.979585
2  0.517834  0.153001

In [62]:
# adding new column
newdata2 = newdf.iloc[0:3,0:3]
newdata2['Z'] = np.random.rand(3)
print(newdata2)

# adding data in row
data3 = pd.DataFrame(np.array([2,4,6,7]).reshape(1,4),index=[3],columns=['W','X','Y','Z'])
print(newdata2.append(data3))

# inserting a new column
newdata2.insert(1,"A",[0.4,0.2,0.1])
print(newdata2)

          W         X         Y         Z
0  0.729399  0.819464  0.763112  0.052625
1  0.837596  0.979585  0.658620  0.300780
2  0.517834  0.153001  0.298523  0.985626
          W         X         Y         Z
0  0.729399  0.819464  0.763112  0.052625
1  0.837596  0.979585  0.658620  0.300780
2  0.517834  0.153001  0.298523  0.985626
3  2.000000  4.000000  6.000000  7.000000
          W    A         X         Y         Z
0  0.729399  0.4  0.819464  0.763112  0.052625
1  0.837596  0.2  0.979585  0.658620  0.300780
2  0.517834  0.1  0.153001  0.298523  0.985626

In [79]:
# creating a new df
data = [(1,2.0,"esosa"), (2,3.0,'katie')]
data2 = pd.DataFrame(data,columns=['A','B','C'])
print(data2,"\n")

# operation
print(">> data2+data2:")
print(data2+data2, "\n")
print(">> data2.count():")
print(data2.count())

# creation of another df
data4 = pd.DataFrame([[3,4,NaN]], index=['x'], columns=['B','C','D'])
print(data4)
print()
# dropping NA
print("dropping NaN...")
time.sleep(1)
print(data4.dropna())

   A    B      C
0  1  2.0  esosa
1  2  3.0  katie

>> data2+data2:
   A    B           C
0  2  4.0  esosaesosa
1  4  6.0  katiekatie

>> data2.count():
A    2
B    2
C    2
dtype: int64
   B  C   D
x  3  4 NaN

dropping NaN...
Empty DataFrame
Columns: [B, C, D]
Index: []

In [85]:
# new DF
data5 = pd.DataFrame({'num': [1,2,3],
                      'year': [100,200,300],},
                     index=['area1','area2','area3'])
print(data5)
data5=data5+1  #data5.add(1)
print(data5)

print(data5-[1,2])

       num  year
area1    1   100
area2    2   200
area3    3   300
       num  year
area1    2   101
area2    3   201
area3    4   301
       num  year
area1    1    99
area2    2   199
area3    3   299

In [90]:
# reading csv file
data = pd.read_csv('tokyo.csv', encoding="latin-1")
data

,Country,Gold Medal,Silver Medal,Bronze Medal,Total,Rank by Total
0,United States of America,39,41,33,113,1
1,People's Republic of China,38,32,18,88,2
2,Japan,27,14,17,58,5
3,Great Britain,22,21,22,65,4
4,ROC,20,28,23,71,3
...,...,...,...,...,...,...
88,Ghana,0,0,1,1,77
89,Grenada,0,0,1,1,77
90,Kuwait,0,0,1,1,77
91,Republic of Moldova,0,0,1,1,77
92,Syrian Arab Republic,0,0,1,1,77

In [97]:
# any sample data
print(data.sample(5))

# any column
print()
print(data.Country)

           Country  Gold Medal  Silver Medal  Bronze Medal  Total  \
17  Czech Republic           4             4             3     11
82      Kazakhstan           0             0             8      8
75         Nigeria           0             1             1      2
68         Armenia           0             2             2      4
76         Bahrain           0             1             0      1

    Rank by Total
17             23
82             29
75             66
68             47
76             77

0       United States of America
1     People's Republic of China
2                          Japan
3                  Great Britain
4                            ROC
                 ...
88                         Ghana
89                       Grenada
90                        Kuwait
91           Republic of Moldova
92          Syrian Arab Republic
Name: Country, Length: 93, dtype: object

In [111]:
# Countries that won more than 10 gold medals
print(data[data['Gold Medal'] > 10].Country)

# count number of countries participated
print(f'\nNo of Countries Participated: {data.Country.count()}')

# Count the number of countries with particular no of Gold medals
print(data['Gold Medal'].value_counts())

0      United States of America
1    People's Republic of China
2                         Japan
3                 Great Britain
4                           ROC
5                     Australia
Name: Country, dtype: object

No of Countries Participated: 93
0     28
1     22
3     11
2     11
4      5
10     4
7      4
6      2
39     1
38     1
27     1
22     1
20     1
17     1
Name: Gold Medal, dtype: int64

In [139]:
from pandas.core.reshape.pivot import pivot_table

# creating spreadsheet
table = data.pivot_table(index='Country')
table

,Bronze Medal,Gold Medal,Rank by Total,Silver Medal,Total
Country,,,,,
Argentina,2,0,60,1,3
Armenia,2,0,47,2,4
Australia,22,17,6,7,46
Austria,5,1,33,1,7
Azerbaijan,4,0,33,3,7
...,...,...,...,...,...
Uganda,1,2,47,1,4
Ukraine,12,1,16,6,19
United States of America,33,39,1,41,113
Uzbekistan,2,3,42,0,5
Venezuela,0,1,47,3,4

In [138]:
# Country name with max medals
medal_max = table[table["Total"]==table['Total'].max()]
print(medal_max.index.values[0]) 

# getting max medals
print(f'Max medals: {medal_max.index.values[0]}, {table["Total"].max()}')

# Total number of medals
print("Total number of medals: ", table.Total.sum())

United States of America
Max medals: United States of America, 113
Total number of medals:  1080

In [144]:
print(table.loc[['India','Japan']])

         Bronze Medal  Gold Medal  Rank by Total  Silver Medal  Total
Country
India               4           1             33             2      7
Japan              17          27              5            14     58